app/controllers/books_controller.rb

  def index
  	@books = Book.all #一覧表示するためにBookモデルの情報を全てくださいのall
---
SELECT "books".* FROM "books"

  def create
  	@book = Book.new(book_params) #Bookモデルのテーブルを使用しているのでbookコントローラで保存する。
    @book.user_id = current_user.id
  	if @book.save #入力されたデータをdbに保存する。
  		redirect_to book_path(@book.id), notice: "successfully created book!"#保存された場合の移動先を指定。
  	else
  		@books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "adsf"], ["body", "asdf"], ["user_id", 1], ["created_at", "2019-12-05 06:23:26.117594"], ["updated_at", "2019-12-05 06:23:26.117594"]]
SELECT "books".* FROM "books"