app/controllers/relationships_controller.rb

INSERT INTO "relationships" ("following_id", "follower_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["following_id", 3], ["follower_id", 1], ["created_at", "2020-01-28 07:22:59.178883"], ["updated_at", "2020-01-28 07:22:59.178883"]]
---
  def create
    follow = current_user.active_relationships.build(follower_id: params[:user_id])
    follow.save

DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 1]]
---
  def destroy
    follow = current_user.active_relationships.find_by(follower_id: params[:user_id])
    follow.destroy